{
    "post": {
        "id": "1nzcucn",
        "title": "EU Countries' Stances on Chat Control as of Early October 2025",
        "author": "SeriouslyNotSerious2",
        "body": "",
        "comments": [
            {
                "id": "ni19ejf",
                "author": "Matyaslike",
                "body": "My country (Hungary) supports it. Therefore chatcontrol is doomed to fail. Thank god it is so easy to predict things.",
                "score": 63,
                "depth": 0
            },
            {
                "id": "ni17bn0",
                "author": "Psychological-Ox_24",
                "body": "How is nobody protesting this on the streets?",
                "score": 204,
                "depth": 0
            },
            {
                "id": "ni18rh5",
                "author": "LitmusPitmus",
                "body": "Less support than I thought but It's insane how this isn't on 0%.\n\n  \nKeeping a close eye on this as the UK has a very similar plan coming in the next 24 months.",
                "score": 57,
                "depth": 0
            },
            {
                "id": "ni16kbw",
                "author": "SeriouslyNotSerious2",
                "body": "Fight Chat Control - Protect Digital Privacy in the EU https://share.google/sqjMmdQQ2MFGeHHiW",
                "score": 67,
                "depth": 0
            },
            {
                "id": "ni17wop",
                "author": "Palliewallie",
                "body": "How has only 2 members voiced their support? That seems extremely low.\n\nGlad we are one of the few countries that is voicing almost full opposition",
                "score": 14,
                "depth": 0
            },
            {
                "id": "ni16wgo",
                "author": "Smart-Sympathy-3933",
                "body": "Crazy part is nobody talks about it here. \n\nNor media, nor politicians. But sure, we live in a “democracy.”",
                "score": 83,
                "depth": 0
            },
            {
                "id": "ni1bola",
                "author": "_WreakingHavok_",
                "body": "If it passes, I'm voting exclusively for the parties that want to quit EU. I don't care how \"damaging it would be to the economy\".",
                "score": 12,
                "depth": 0
            },
            {
                "id": "ni19wmd",
                "author": "Nzkx",
                "body": "Whoever proposed this law should be permabanned from the European Union.",
                "score": 24,
                "depth": 0
            },
            {
                "id": "ni1895h",
                "author": "silentspectator27",
                "body": "I hope France changes its stance now that their government collapsed again but that’s just wishful thinking on my end 😞",
                "score": 20,
                "depth": 0
            },
            {
                "id": "ni1aqes",
                "author": "Striking_Chef739",
                "body": "Denmark can go and fuck themselves rbout now",
                "score": 25,
                "depth": 0
            },
            {
                "id": "ni1aiyw",
                "author": "juicythumbs",
                "body": "Contact your meps:\n\nhttps://fightchatcontrol.eu/\n\nAnd sign this petitions:\n\nhttps://crm.edri.org/stop-scanning-me\n\nhttps://stopchatcontrol.fr/english/\n\nIf you're Danish:\n\nhttps://www.borgerforslag.dk/se-og-stoet-forslag/?Id=FT-21156\n\nPlease also share the message in the subreddits of your country.",
                "score": 6,
                "depth": 0
            },
            {
                "id": "ni1an9z",
                "author": "Hopeful_Hat_3532",
                "body": "Well well well, Belgium back in the opposition camp.  \nJust wonder if this data is 100% accurate and reliable. It's rather improbable that Belgium is shifting from being opposed to it, then to in favor, and back to in opposition.",
                "score": 5,
                "depth": 0
            },
            {
                "id": "ni1fh86",
                "author": "aurelag",
                "body": "How is France considered supporting it when they have more opposed (42) than presumed support (39) ?",
                "score": 5,
                "depth": 0
            },
            {
                "id": "ni19b1v",
                "author": "SeaTomago",
                "body": "This graph makes no sense. Firstly, formal votes are usually (although not always for politically sensitive issues) formalities, as consent between the Parliament and Council has already before been reached in the so called trilogue negotiations. Votes are usually only rubberstamping that. Either there is a compromise in which case the vote takes place and usually just is a yes or there is no compromise in which case there usually is no vote. Secondly, this graph conflates voting in the EP and the Council. Blocking minorities or rather double qualified majorities are only a thing in the Council of the EU. The graph for some reasons shows how many MEPs voiced aupport or opposition. Parliament usually votes by simple majority and by party lines not national lines. There is no such thing as \"Germany supporting a proposal in Parliament\". Germany in Council and German MEPs in EP are two completely different entities and votes. Even MEPs from governmental parties might vote entirely different from their government in the council, although rare. In general, both institutions try to be as uniform a front as possible as the divide usually is often more Parliament against Council as opposed to country vs country or party vs party. For this reason, letters to MEPs do not really make sense if the goal is to achieve a blocking minority in the Council. Those letters would have to go to governments.",
                "score": 6,
                "depth": 0
            },
            {
                "id": "ni1ewzd",
                "author": "FriendlyUser_",
                "body": "yay at least one sector i can be proud of beeing Austrian.",
                "score": 3,
                "depth": 0
            },
            {
                "id": "ni1hux0",
                "author": "Laffargan",
                "body": "even the one proposed it is opposing it 🤣",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni18tz3",
                "author": "John_Hater",
                "body": "My country got the marching orders from Brussels, so of course it supports it even though we had a revolution and executed a tyrant in 1989 so the government doesn't look into private conversations without a court order.\n\nIt's ok, we can do it again.",
                "score": 5,
                "depth": 0
            },
            {
                "id": "ni1f82p",
                "author": "Bananinio",
                "body": "One voice support…",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1hkps",
                "author": "SamFreelancePolice",
                "body": "I emailed all my representatives in Portugal and got no reply. Now I see why",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1iq2u",
                "author": "milkcutie314",
                "body": "Don't lie about hungary, for 8 you can safely presume oppose only about fidesz should it be presumed they are in support of this",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1jqub",
                "author": "WeeklyDelivery2000",
                "body": "Something is rotten in the state of Denmark",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1kg3d",
                "author": "19osemi",
                "body": "Denmark and Ireland can actually shove this chat control up their ass, Christ why the fuck did Denmark even suggest this shit.",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1ltdb",
                "author": "Enough_Code_3831",
                "body": "They are trying to solve a problem creating a bigger one. Mass surveillance is not the solution.",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1m0eo",
                "author": "bgboy089",
                "body": "What is funny is that they're trying to push it forward using the child safety part and the moment someone tries to protest around it, they try and call him out for being a PDF file, but at the same time, they exempt all politicians and all CEOs corporate phones from falling under chat control. So, using their own logic, all politicians in the EU and all CEOs are actually P-Diddy-files?",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1m0lk",
                "author": "Shadow_Soulheart",
                "body": "I'm fairly sure that the 74 Italian undecided have no fucking clue what this is about. Meaning, they have no idea such a law has been proposed.",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1m9zo",
                "author": "MediaPuzzled8166",
                "body": "If all but one of Malta's MEPs have voiced opposition (with one undecided), why is Malta listed as a country that supports the bill?",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni18bpq",
                "author": "Tiny_Permit1128",
                "body": "Where can i find the greek members that have voiced opposition?",
                "score": 1,
                "depth": 0
            },
            {
                "id": "ni1cxao",
                "author": "DueSeaworthiness8222",
                "body": "reasons i support this shit:\n\nall of the enemies/rivals of europe are against it\n\nthe people are clearly being fed naratives\n\nthe dead internet theory is real, bots are exploiting every algorithm\n\nwith a more controled internet maybe it can revert back to the 2000's (the internet got worse directly proportional with the number of bots)",
                "score": -2,
                "depth": 0
            },
            {
                "id": "ni1fklw",
                "author": "L-Malvo",
                "body": "Honestly, this is an important barometer. Given the way Hungary operates, it should be a clear red flag for other countries.",
                "score": 17,
                "depth": 1
            },
            {
                "id": "ni1ahsu",
                "author": "Hopeful_Hat_3532",
                "body": "I think most are not aware of this at all.  \nAnd it's not like they often talk about in TV news. Mostly us, exposed to Reddit for instance, are being often reminded of this topic.",
                "score": 85,
                "depth": 1
            },
            {
                "id": "ni1bvfc",
                "author": "The_RedfuckingHood",
                "body": "Its not on the news.",
                "score": 24,
                "depth": 1
            },
            {
                "id": "ni1916l",
                "author": "John_Hater",
                "body": "Most people are fucking drones! \n\nThey don't know anything and don't care about anything until it bites them in the ass, and by that point it's already too late and things can't be changed back without violence.",
                "score": 49,
                "depth": 1
            },
            {
                "id": "ni1bcnt",
                "author": "Equivalent-Pound9512",
                "body": "only George Floyd(PBUH) was worth protesting over",
                "score": -15,
                "depth": 1
            },
            {
                "id": "ni1f1w8",
                "author": "vriska1",
                "body": "> UK has a very similar plan coming in the next 24 months. \n\n\nLink to information on that?",
                "score": 4,
                "depth": 1
            },
            {
                "id": "ni1bjly",
                "author": "_WreakingHavok_",
                "body": "Sent them emails, but received generic answers from some MPs.",
                "score": 12,
                "depth": 1
            },
            {
                "id": "ni19oxs",
                "author": "fhrwddsgshfhgdnhrrtg",
                "body": "Its very simple, you just say it needs work, now is not the time, we are considering all options, etc. and then you vote for anyway",
                "score": 8,
                "depth": 1
            },
            {
                "id": "ni1basb",
                "author": "anarchisto",
                "body": "They know that an overwhelming percentage of people hate this, so they try not to admit they're going to vote for it.",
                "score": 7,
                "depth": 1
            },
            {
                "id": "ni19gt5",
                "author": "TheSmokeu",
                "body": "Only shows who really controls the media\n\n\"If you want to know who rules over you, just look for who you are not allowed to criticize.\"",
                "score": 23,
                "depth": 1
            },
            {
                "id": "ni1bsxs",
                "author": "BirbDoryx",
                "body": "Here in Italy, our MPs were interviewed. Most of them do not even know what it is, while the rest think it is a matter for the European Parliament and don't care.",
                "score": 7,
                "depth": 1
            },
            {
                "id": "ni1a66k",
                "author": "ApprehensiveGold2773",
                "body": "That's on purpose. The people in power are desperate for this to pass so that they can exploit it. We need to start jailing evil people.",
                "score": 2,
                "depth": 1
            },
            {
                "id": "ni1akrz",
                "author": "SeaTomago",
                "body": "You do not hear about this not because of some nefarious reasons or \"not living in a democracy\" but rather because it is a niche blown-out of proportion and fearmongering topic, propagated by people having no clue about policymaking as proven by the absolutely atrocious quality of this graph. Furthermore, journalists are usually just as uneducated about EU policymaking and readers on average not very interested, which is why EU topics are usually not very salient, and if they are reporting on them is usually of atrocious quality. The European institutions provide excellent public information in the policy cycle, proposals and opportunities to have your say on their websites. It is just that policy making is complex and if it is not your special interest it is hard to filter and digest.",
                "score": -4,
                "depth": 1
            },
            {
                "id": "ni19109",
                "author": "Florestana",
                "body": "All I've seen on Reddit the last month has been posts about chat control, you can't be serious",
                "score": -6,
                "depth": 1
            },
            {
                "id": "ni1ei43",
                "author": "simonlinds",
                "body": "I apologise on behalf of my country!",
                "score": 5,
                "depth": 1
            },
            {
                "id": "ni1avlo",
                "author": "Hopeful_Hat_3532",
                "body": "If it's the same as our legendary country, when there's no government, everything's just basically frozen, sadly.",
                "score": 5,
                "depth": 1
            },
            {
                "id": "ni1ij3l",
                "author": "Volesprit31",
                "body": "I don't understand the chart. France is in red but in the table, the opposition is in majority.",
                "score": 1,
                "depth": 1
            },
            {
                "id": "ni1bym9",
                "author": "The_RedfuckingHood",
                "body": "If this passes, l genuinely hope they lose Greenland.",
                "score": 10,
                "depth": 1
            },
            {
                "id": "ni1hrla",
                "author": "larananne",
                "body": "Direct your rage at a few of our politicians; very few danish citizens want this, it's absolute hell right now and we're fighting our own politicians with tooth and claw!",
                "score": 1,
                "depth": 1
            },
            {
                "id": "ni1c5i4",
                "author": "The_RedfuckingHood",
                "body": "That doesn't work if you don't get a response.",
                "score": 2,
                "depth": 1
            },
            {
                "id": "ni1ba2w",
                "author": "silentspectator27",
                "body": "Well the government stance is undecided but supports it in principle.",
                "score": 1,
                "depth": 1
            },
            {
                "id": "ni1fouo",
                "author": "silentspectator27",
                "body": "Because the people it had in the Council support it. These are from the EU Parliament, two different bodies.",
                "score": 3,
                "depth": 1
            },
            {
                "id": "ni1dat2",
                "author": "ankokudaishogun",
                "body": "> Germany in Council and German MEPs in EP are two completely different entities and votes. \n\nwhich, by the way, it's by design: it means multiple different sides must agree on something to truly pass.   \nThis has the side effect of making everything slow and hard to implement changes, but also makes it so \"bad\" changes *also* have a much harder time to pass.",
                "score": 6,
                "depth": 1
            },
            {
                "id": "ni1e9ob",
                "author": "Falrehn",
                "body": "Also the result of the negotiations can lead to a very different version than the current iterations that are floated around. As a representative you can at most voice a general position, which can change based on the actual legislation that is presented to you. It’s comforting to have many MEPs voicing opposition though this can probably change if a more favorable position is achieved during trilogues and a watered down version sees the light of the plenary",
                "score": 2,
                "depth": 1
            },
            {
                "id": "ni19nxs",
                "author": "DVDPROYTP",
                "body": "The evil sexomarxist globalists in brussels forcing romania to support bad policy :\n\n\nHow about contacting our MEPs and telling them we as citizens really care about this and want it stopped - that's how most countries that opposed it ended up doing so",
                "score": 4,
                "depth": 1
            },
            {
                "id": "ni1a7by",
                "author": "silentspectator27",
                "body": "Mine too, the price we pay for Schengen, eh? :(",
                "score": 2,
                "depth": 1
            },
            {
                "id": "ni1gmss",
                "author": "L-Malvo",
                "body": "If dead internet theory and bots are the main concern, why not simply target social media companies with more strict legislation to combat that. The mainstream social media platforms have the tools to easily detect bots without identification or chat control. Do you remember the \"prove you're not a bot\" prompts when opening websites, measures like that could work on social media as well. \n\nThe real reason why social media is full of bots is late stage capitalism. Social media companies are chasing infinite growth in an a relatively finite market. The only way they can really grow/inflate their numbers is with bots. Imagine if we would take out all bot users of social media platforms today, the stock prices of these companies would plummet, because it would become apparent how many real users they actually have, which is far less than the reported figures. In other words, social media companies benefit massively from bots, so why would they solve the issue? Chat control and online ID won't change that.\n\nSecondly, chat control won't protect us from criminals either. Criminals can easily use their own platforms, like they do today, to circumvent this legislation. It's like using a shotgun to kill a fly, but the fly can easily fly in any other direction to evade it. \n\nThe only thing this proposed legislation can achieve is mass surveillance, there are no other \"benefits\". You might think: \"I'm not that interesting, so why do I care?\". The thing is, there are numerous people that are interesting to be surveilled at this level. Think journalists, judges, lawyers, politicians, police, etc. These professions have one thing in common: they are responsible to uphold our democratic norms and values, they ensure that the political powers remain separated and in check. \n\nImagine you're Russia, China, or any criminal organisation capable of hacking secure infrastructure. With this legislation, they have a honeypot to with 1 hack, social engineering or infiltration, get all chat history of people in influential or important positions. They can blackmail and extort these people to get what they want. It is a massive, massive risk to democracy.\n\nSo when you say: \"I'm in favor of a more controlled internet\", you're basically saying: \"I wave all my democratic rights and be a loyal servant to whatever regime holds the keys to the internet.\" Today, this regime can be a regime you trust, but you just created the tools for whichever regime comes after to have total control over the internet.",
                "score": 1,
                "depth": 1
            },
            {
                "id": "ni1f1qx",
                "author": "silentspectator27",
                "body": "Lol, okay, you just believe that, cupcake. I’m not waiving my rights under article 7 and 8 of the EU charter of Fundamental Rights just because you have nostalgia.",
                "score": 2,
                "depth": 1
            },
            {
                "id": "ni1i0ju",
                "author": "apxseemax",
                "body": "Bruh. The only thing you comment screams is that you do not understand a single thing about what this could cause should it be agreed upon.",
                "score": 1,
                "depth": 1
            },
            {
                "id": "ni1goua",
                "author": "Matyaslike",
                "body": "We do the greatest service for humanity by always pointing out what not to do. You are all welcome.",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1k8u3",
                "author": "Vannnnah",
                "body": "you underestimate how many people are secretly or sometimes not so secretly agreeing with Orban on some things but are staying silent to not fall from grace in public",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1i07n",
                "author": "HeyGayHay",
                "body": "You think right, most don’t know about it. Those who do heard a short news report about „regulation for social media and chats to protect the kids in the internet“ which sounds good to them because they associate social media with bad habits and online predators are everywhere to steal their kids through chats in roblox. They don’t understand that random people will be able to see your private life, people can spy on businesses and their secrets and sell it, the hacker bears will 100% infiltrate it and find ways to social engineer the population close to voting cycles, presumably even the US will abuse it, and politicians can protect their pedophile siblings from chat control.\n\nOutside of reddit, this is rarely mentioned. As always, reddit is a small minority and even if you share this screenshot to most people they only see 33% opposition and think it’s never gonna pass so why spend the effort when you have other issues like rambling on facebook about something ",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1fvmb",
                "author": "AnalTinnitus",
                "body": "This.  The news keeps us distracted with immigrants and celebrity rubbish.",
                "score": 4,
                "depth": 2
            },
            {
                "id": "ni1adct",
                "author": "Cool-Psychology-4896",
                "body": "We need to rise up against children with leukemia.",
                "score": 20,
                "depth": 2
            },
            {
                "id": "ni1ax7d",
                "author": "Florestana",
                "body": "Thank you for being sane",
                "score": -3,
                "depth": 2
            },
            {
                "id": "ni19tgx",
                "author": "TheSmokeu",
                "body": "Proximity bias\n\nOutside of Reddit, chat control law proposition is pretty much unheard of",
                "score": 18,
                "depth": 2
            },
            {
                "id": "ni19wk1",
                "author": "Zestyclose-Cow8549",
                "body": "He obviously means in the EU on the street/traditional media",
                "score": 6,
                "depth": 2
            },
            {
                "id": "ni1asev",
                "author": "Hopeful_Hat_3532",
                "body": "Reddit is not the only \"media\", and certainly not \"politicians\".  \nWhat about news websites, newspapers, tv news, social networks, etc. ?",
                "score": 2,
                "depth": 2
            },
            {
                "id": "ni1a558",
                "author": "slimfatty69",
                "body": "I think \"about it here\" was probs refrencing a local news outlet.",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1j4kr",
                "author": "gccol",
                "body": "Exactly, I don't get it neither",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1ja1h",
                "author": "silentspectator27",
                "body": "European Council: This body comprises the heads of state or government of the EU (the people from France that are in Favour).\nThe chart shows the members of the European Parliament",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni1c0vc",
                "author": "Striking_Chef739",
                "body": "🤣 I'll support Trump in his one hahah",
                "score": 2,
                "depth": 2
            },
            {
                "id": "ni1cds2",
                "author": "juicythumbs",
                "body": "I personally don't want to hive up hope.",
                "score": 3,
                "depth": 2
            },
            {
                "id": "ni1g3sl",
                "author": "aurelag",
                "body": "Then if the council is for the bill, can the parliament block it ? Because the parliament is more encouraging",
                "score": 1,
                "depth": 2
            },
            {
                "id": "ni19st5",
                "author": "John_Hater",
                "body": "LOL. As if that matters at all. Politicians do whatever they want, especially when they get marching orders from Central. Just like Starmer in UK does whatever the fuck he wants despite the huge public backlash.\n\nBut it's okay, it's okay, next elections AUR will have 50% all by itself. All this bullshit eventually has consequences, you can only piss off the people for as long as they have no alternatives.",
                "score": -2,
                "depth": 2
            },
            {
                "id": "ni1akmc",
                "author": "TheSmokeu",
                "body": "Those freaking children with leukemia",
                "score": 4,
                "depth": 3
            },
            {
                "id": "ni1ccfw",
                "author": "SaltyHater",
                "body": "I've been very vocal about how we should all oppose the damn leukemiatards, but nobody imprisoned me yet. \n\nGuys, I'm starting to believe that kids with leukemia aren't actually the problem",
                "score": 3,
                "depth": 3
            },
            {
                "id": "ni1f8z5",
                "author": "Iranon79",
                "body": "We should be able to criticize children with leukemia, and for the most part we are.\n\nThey have it rough, and we're rightfully expected to show some humanity. But if one is being an asshat we can point it out, doubly so if they're exploiting the baseline sympathy they get.",
                "score": 2,
                "depth": 3
            },
            {
                "id": "ni1apr6",
                "author": "Florestana",
                "body": "\"Nobody talks about it here\"\n\nI interpreted that as reddit/r/Europe\n\nI see now that the commenter probably meant their country. Wasn't exactly clear tho",
                "score": 0,
                "depth": 3
            },
            {
                "id": "ni1cpdv",
                "author": "SeaTomago",
                "body": "Denmark did not propose this. It is another misconception of the author. The European Commission has for most intents and purposes the sole power of initiative in the EU and proposed this law. Denmark currently holds the so called presidency of the council of the EU. This presidency changes semi annually. The country having the presidency is expected to coordinate the work of countries in the council of the EU, one of the legislative bodies, in that time. The legislative process has a phase during which both legislators, the Parliament and the Council, agree on their respective internal positions. Denmark had the job to do this for this proposal. This culminated in a so called general approach, i.e. an agreement in the Council for their position in the negotiations with the Parliament on the final legal text. This was done by Denmark, as it is their job to do so for all proposals due for negotiations this half year.",
                "score": 5,
                "depth": 3
            },
            {
                "id": "ni1g7xk",
                "author": "silentspectator27",
                "body": "By voting. Problem is that Parliament has voted against for very few Council proposals (like ACTA), and tend to negotiate, rather than outright block.",
                "score": 2,
                "depth": 3
            },
            {
                "id": "ni1alfs",
                "author": "DVDPROYTP",
                "body": "It literally does matter becauae most of these MEPs likely don't know or don't care enough about this law. The few MEPs that voiced their opposition did so precisely because voters such as you and me repeatedly contacted them to address their concerns. Because, you know, if voters care about a certain policy it sure is useful to comply since it helps you win elections.\n\nThis is why for example Starmer is not in fact able to just get away with his measures. Because they are dooming labour to another 15 years in the opposition. If that's what they want sure , but they will be punished at the next elections.\n\nAlso can we stop with this stupid \"marching order\" narrative ? There is no such thing as \"marching orders from central\" in Europe (or most places but romanians assume the planet functions like the fucking PCR). This is not hoi4, this is real life.",
                "score": 3,
                "depth": 3
            },
            {
                "id": "ni1fk9v",
                "author": "uxreqo",
                "body": "nah you just gotta double down on em",
                "score": 3,
                "depth": 4
            },
            {
                "id": "ni1f67y",
                "author": "silentspectator27",
                "body": "And one of the authors of said proposal that continues to say people don’t deserve internet privacy happens to be Denmark’s MoJ.",
                "score": 5,
                "depth": 4
            },
            {
                "id": "ni1g9ql",
                "author": "aurelag",
                "body": "Ok thanks !",
                "score": 1,
                "depth": 4
            },
            {
                "id": "ni1l8wc",
                "author": "Ok-Captain-5207",
                "body": "Just look at his posts/comments. He is an uneducated gamer and also a grifter. Too bad Chat Control won't affect only these type of people.",
                "score": 1,
                "depth": 4
            },
            {
                "id": "ni1fpfe",
                "author": "SeaTomago",
                "body": "To reach a general approach a vote in COREPER takes place which is usually based on collegiality and unanimity as much as possible. MoJ or equivalent (to be correct permanent representatives as ministers are not in COREPER, ministers did not necessarily vote at all depending on if it was an A or B item) from all MS agreed with the general approach. Singling out Denmark makes no sense and is harmful.",
                "score": 1,
                "depth": 5
            },
            {
                "id": "ni1g40q",
                "author": "silentspectator27",
                "body": "Hogwash. The Danish government has been supporting image and chat scanning. In fact the Danish MoJ was caught spreading false narratives that Parliament was pushing for a permanent decision on the interim law in place.",
                "score": 1,
                "depth": 6
            }
        ],
        "score": 363,
        "sentiment": "neutral",
        "url": "https://www.reddit.com/r/europe/comments/1nzcucn/eu_countries_stances_on_chat_control_as_of_early/"
    },
    "comments": [
        {
            "id": "ni19ejf",
            "author": "Matyaslike",
            "body": "My country (Hungary) supports it. Therefore chatcontrol is doomed to fail. Thank god it is so easy to predict things.",
            "score": 63,
            "depth": 0,
            "sentiment": "sadness"
        },
        {
            "id": "ni17bn0",
            "author": "Psychological-Ox_24",
            "body": "How is nobody protesting this on the streets?",
            "score": 204,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni18rh5",
            "author": "LitmusPitmus",
            "body": "Less support than I thought but It's insane how this isn't on 0%.\n\n  \nKeeping a close eye on this as the UK has a very similar plan coming in the next 24 months.",
            "score": 57,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni16kbw",
            "author": "SeriouslyNotSerious2",
            "body": "Fight Chat Control - Protect Digital Privacy in the EU https://share.google/sqjMmdQQ2MFGeHHiW",
            "score": 67,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni17wop",
            "author": "Palliewallie",
            "body": "How has only 2 members voiced their support? That seems extremely low.\n\nGlad we are one of the few countries that is voicing almost full opposition",
            "score": 14,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni16wgo",
            "author": "Smart-Sympathy-3933",
            "body": "Crazy part is nobody talks about it here. \n\nNor media, nor politicians. But sure, we live in a “democracy.”",
            "score": 83,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1bola",
            "author": "_WreakingHavok_",
            "body": "If it passes, I'm voting exclusively for the parties that want to quit EU. I don't care how \"damaging it would be to the economy\".",
            "score": 12,
            "depth": 0,
            "sentiment": "disgust"
        },
        {
            "id": "ni19wmd",
            "author": "Nzkx",
            "body": "Whoever proposed this law should be permabanned from the European Union.",
            "score": 24,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1895h",
            "author": "silentspectator27",
            "body": "I hope France changes its stance now that their government collapsed again but that’s just wishful thinking on my end 😞",
            "score": 20,
            "depth": 0,
            "sentiment": "sadness"
        },
        {
            "id": "ni1aqes",
            "author": "Striking_Chef739",
            "body": "Denmark can go and fuck themselves rbout now",
            "score": 25,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni1aiyw",
            "author": "juicythumbs",
            "body": "Contact your meps:\n\nhttps://fightchatcontrol.eu/\n\nAnd sign this petitions:\n\nhttps://crm.edri.org/stop-scanning-me\n\nhttps://stopchatcontrol.fr/english/\n\nIf you're Danish:\n\nhttps://www.borgerforslag.dk/se-og-stoet-forslag/?Id=FT-21156\n\nPlease also share the message in the subreddits of your country.",
            "score": 6,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1an9z",
            "author": "Hopeful_Hat_3532",
            "body": "Well well well, Belgium back in the opposition camp.  \nJust wonder if this data is 100% accurate and reliable. It's rather improbable that Belgium is shifting from being opposed to it, then to in favor, and back to in opposition.",
            "score": 5,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni1fh86",
            "author": "aurelag",
            "body": "How is France considered supporting it when they have more opposed (42) than presumed support (39) ?",
            "score": 5,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni19b1v",
            "author": "SeaTomago",
            "body": "This graph makes no sense. Firstly, formal votes are usually (although not always for politically sensitive issues) formalities, as consent between the Parliament and Council has already before been reached in the so called trilogue negotiations. Votes are usually only rubberstamping that. Either there is a compromise in which case the vote takes place and usually just is a yes or there is no compromise in which case there usually is no vote. Secondly, this graph conflates voting in the EP and the Council. Blocking minorities or rather double qualified majorities are only a thing in the Council of the EU. The graph for some reasons shows how many MEPs voiced aupport or opposition. Parliament usually votes by simple majority and by party lines not national lines. There is no such thing as \"Germany supporting a proposal in Parliament\". Germany in Council and German MEPs in EP are two completely different entities and votes. Even MEPs from governmental parties might vote entirely different from their government in the council, although rare. In general, both institutions try to be as uniform a front as possible as the divide usually is often more Parliament against Council as opposed to country vs country or party vs party. For this reason, letters to MEPs do not really make sense if the goal is to achieve a blocking minority in the Council. Those letters would have to go to governments.",
            "score": 6,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1ewzd",
            "author": "FriendlyUser_",
            "body": "yay at least one sector i can be proud of beeing Austrian.",
            "score": 3,
            "depth": 0,
            "sentiment": "joy"
        },
        {
            "id": "ni1hux0",
            "author": "Laffargan",
            "body": "even the one proposed it is opposing it 🤣",
            "score": 1,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni18tz3",
            "author": "John_Hater",
            "body": "My country got the marching orders from Brussels, so of course it supports it even though we had a revolution and executed a tyrant in 1989 so the government doesn't look into private conversations without a court order.\n\nIt's ok, we can do it again.",
            "score": 5,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1f82p",
            "author": "Bananinio",
            "body": "One voice support…",
            "score": 1,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1hkps",
            "author": "SamFreelancePolice",
            "body": "I emailed all my representatives in Portugal and got no reply. Now I see why",
            "score": 1,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni1iq2u",
            "author": "milkcutie314",
            "body": "Don't lie about hungary, for 8 you can safely presume oppose only about fidesz should it be presumed they are in support of this",
            "score": 1,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1jqub",
            "author": "WeeklyDelivery2000",
            "body": "Something is rotten in the state of Denmark",
            "score": 1,
            "depth": 0,
            "sentiment": "disgust"
        },
        {
            "id": "ni1kg3d",
            "author": "19osemi",
            "body": "Denmark and Ireland can actually shove this chat control up their ass, Christ why the fuck did Denmark even suggest this shit.",
            "score": 1,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni1ltdb",
            "author": "Enough_Code_3831",
            "body": "They are trying to solve a problem creating a bigger one. Mass surveillance is not the solution.",
            "score": 1,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni1m0eo",
            "author": "bgboy089",
            "body": "What is funny is that they're trying to push it forward using the child safety part and the moment someone tries to protest around it, they try and call him out for being a PDF file, but at the same time, they exempt all politicians and all CEOs corporate phones from falling under chat control. So, using their own logic, all politicians in the EU and all CEOs are actually P-Diddy-files?",
            "score": 1,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni1m0lk",
            "author": "Shadow_Soulheart",
            "body": "I'm fairly sure that the 74 Italian undecided have no fucking clue what this is about. Meaning, they have no idea such a law has been proposed.",
            "score": 1,
            "depth": 0,
            "sentiment": "surprise"
        },
        {
            "id": "ni1m9zo",
            "author": "MediaPuzzled8166",
            "body": "If all but one of Malta's MEPs have voiced opposition (with one undecided), why is Malta listed as a country that supports the bill?",
            "score": 1,
            "depth": 0,
            "sentiment": "neutral"
        },
        {
            "id": "ni18bpq",
            "author": "Tiny_Permit1128",
            "body": "Where can i find the greek members that have voiced opposition?",
            "score": 1,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni1cxao",
            "author": "DueSeaworthiness8222",
            "body": "reasons i support this shit:\n\nall of the enemies/rivals of europe are against it\n\nthe people are clearly being fed naratives\n\nthe dead internet theory is real, bots are exploiting every algorithm\n\nwith a more controled internet maybe it can revert back to the 2000's (the internet got worse directly proportional with the number of bots)",
            "score": -2,
            "depth": 0,
            "sentiment": "anger"
        },
        {
            "id": "ni1fklw",
            "author": "L-Malvo",
            "body": "Honestly, this is an important barometer. Given the way Hungary operates, it should be a clear red flag for other countries.",
            "score": 17,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1ahsu",
            "author": "Hopeful_Hat_3532",
            "body": "I think most are not aware of this at all.  \nAnd it's not like they often talk about in TV news. Mostly us, exposed to Reddit for instance, are being often reminded of this topic.",
            "score": 85,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1bvfc",
            "author": "The_RedfuckingHood",
            "body": "Its not on the news.",
            "score": 24,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1916l",
            "author": "John_Hater",
            "body": "Most people are fucking drones! \n\nThey don't know anything and don't care about anything until it bites them in the ass, and by that point it's already too late and things can't be changed back without violence.",
            "score": 49,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1bcnt",
            "author": "Equivalent-Pound9512",
            "body": "only George Floyd(PBUH) was worth protesting over",
            "score": -15,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1f1w8",
            "author": "vriska1",
            "body": "> UK has a very similar plan coming in the next 24 months. \n\n\nLink to information on that?",
            "score": 4,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1bjly",
            "author": "_WreakingHavok_",
            "body": "Sent them emails, but received generic answers from some MPs.",
            "score": 12,
            "depth": 1,
            "sentiment": "sadness"
        },
        {
            "id": "ni19oxs",
            "author": "fhrwddsgshfhgdnhrrtg",
            "body": "Its very simple, you just say it needs work, now is not the time, we are considering all options, etc. and then you vote for anyway",
            "score": 8,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1basb",
            "author": "anarchisto",
            "body": "They know that an overwhelming percentage of people hate this, so they try not to admit they're going to vote for it.",
            "score": 7,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni19gt5",
            "author": "TheSmokeu",
            "body": "Only shows who really controls the media\n\n\"If you want to know who rules over you, just look for who you are not allowed to criticize.\"",
            "score": 23,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1bsxs",
            "author": "BirbDoryx",
            "body": "Here in Italy, our MPs were interviewed. Most of them do not even know what it is, while the rest think it is a matter for the European Parliament and don't care.",
            "score": 7,
            "depth": 1,
            "sentiment": "disgust"
        },
        {
            "id": "ni1a66k",
            "author": "ApprehensiveGold2773",
            "body": "That's on purpose. The people in power are desperate for this to pass so that they can exploit it. We need to start jailing evil people.",
            "score": 2,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1akrz",
            "author": "SeaTomago",
            "body": "You do not hear about this not because of some nefarious reasons or \"not living in a democracy\" but rather because it is a niche blown-out of proportion and fearmongering topic, propagated by people having no clue about policymaking as proven by the absolutely atrocious quality of this graph. Furthermore, journalists are usually just as uneducated about EU policymaking and readers on average not very interested, which is why EU topics are usually not very salient, and if they are reporting on them is usually of atrocious quality. The European institutions provide excellent public information in the policy cycle, proposals and opportunities to have your say on their websites. It is just that policy making is complex and if it is not your special interest it is hard to filter and digest.",
            "score": -4,
            "depth": 1,
            "sentiment": "disgust"
        },
        {
            "id": "ni19109",
            "author": "Florestana",
            "body": "All I've seen on Reddit the last month has been posts about chat control, you can't be serious",
            "score": -6,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1ei43",
            "author": "simonlinds",
            "body": "I apologise on behalf of my country!",
            "score": 5,
            "depth": 1,
            "sentiment": "sadness"
        },
        {
            "id": "ni1avlo",
            "author": "Hopeful_Hat_3532",
            "body": "If it's the same as our legendary country, when there's no government, everything's just basically frozen, sadly.",
            "score": 5,
            "depth": 1,
            "sentiment": "sadness"
        },
        {
            "id": "ni1ij3l",
            "author": "Volesprit31",
            "body": "I don't understand the chart. France is in red but in the table, the opposition is in majority.",
            "score": 1,
            "depth": 1,
            "sentiment": "surprise"
        },
        {
            "id": "ni1bym9",
            "author": "The_RedfuckingHood",
            "body": "If this passes, l genuinely hope they lose Greenland.",
            "score": 10,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1hrla",
            "author": "larananne",
            "body": "Direct your rage at a few of our politicians; very few danish citizens want this, it's absolute hell right now and we're fighting our own politicians with tooth and claw!",
            "score": 1,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1c5i4",
            "author": "The_RedfuckingHood",
            "body": "That doesn't work if you don't get a response.",
            "score": 2,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1ba2w",
            "author": "silentspectator27",
            "body": "Well the government stance is undecided but supports it in principle.",
            "score": 1,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1fouo",
            "author": "silentspectator27",
            "body": "Because the people it had in the Council support it. These are from the EU Parliament, two different bodies.",
            "score": 3,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1dat2",
            "author": "ankokudaishogun",
            "body": "> Germany in Council and German MEPs in EP are two completely different entities and votes. \n\nwhich, by the way, it's by design: it means multiple different sides must agree on something to truly pass.   \nThis has the side effect of making everything slow and hard to implement changes, but also makes it so \"bad\" changes *also* have a much harder time to pass.",
            "score": 6,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1e9ob",
            "author": "Falrehn",
            "body": "Also the result of the negotiations can lead to a very different version than the current iterations that are floated around. As a representative you can at most voice a general position, which can change based on the actual legislation that is presented to you. It’s comforting to have many MEPs voicing opposition though this can probably change if a more favorable position is achieved during trilogues and a watered down version sees the light of the plenary",
            "score": 2,
            "depth": 1,
            "sentiment": "joy"
        },
        {
            "id": "ni19nxs",
            "author": "DVDPROYTP",
            "body": "The evil sexomarxist globalists in brussels forcing romania to support bad policy :\n\n\nHow about contacting our MEPs and telling them we as citizens really care about this and want it stopped - that's how most countries that opposed it ended up doing so",
            "score": 4,
            "depth": 1,
            "sentiment": "anger"
        },
        {
            "id": "ni1a7by",
            "author": "silentspectator27",
            "body": "Mine too, the price we pay for Schengen, eh? :(",
            "score": 2,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1gmss",
            "author": "L-Malvo",
            "body": "If dead internet theory and bots are the main concern, why not simply target social media companies with more strict legislation to combat that. The mainstream social media platforms have the tools to easily detect bots without identification or chat control. Do you remember the \"prove you're not a bot\" prompts when opening websites, measures like that could work on social media as well. \n\nThe real reason why social media is full of bots is late stage capitalism. Social media companies are chasing infinite growth in an a relatively finite market. The only way they can really grow/inflate their numbers is with bots. Imagine if we would take out all bot users of social media platforms today, the stock prices of these companies would plummet, because it would become apparent how many real users they actually have, which is far less than the reported figures. In other words, social media companies benefit massively from bots, so why would they solve the issue? Chat control and online ID won't change that.\n\nSecondly, chat control won't protect us from criminals either. Criminals can easily use their own platforms, like they do today, to circumvent this legislation. It's like using a shotgun to kill a fly, but the fly can easily fly in any other direction to evade it. \n\nThe only thing this proposed legislation can achieve is mass surveillance, there are no other \"benefits\". You might think: \"I'm not that interesting, so why do I care?\". The thing is, there are numerous people that are interesting to be surveilled at this level. Think journalists, judges, lawyers, politicians, police, etc. These professions have one thing in common: they are responsible to uphold our democratic norms and values, they ensure that the political powers remain separated and in check. \n\nImagine you're Russia, China, or any criminal organisation capable of hacking secure infrastructure. With this legislation, they have a honeypot to with 1 hack, social engineering or infiltration, get all chat history of people in influential or important positions. They can blackmail and extort these people to get what they want. It is a massive, massive risk to democracy.\n\nSo when you say: \"I'm in favor of a more controlled internet\", you're basically saying: \"I wave all my democratic rights and be a loyal servant to whatever regime holds the keys to the internet.\" Today, this regime can be a regime you trust, but you just created the tools for whichever regime comes after to have total control over the internet.",
            "score": 1,
            "depth": 1,
            "sentiment": "fear"
        },
        {
            "id": "ni1f1qx",
            "author": "silentspectator27",
            "body": "Lol, okay, you just believe that, cupcake. I’m not waiving my rights under article 7 and 8 of the EU charter of Fundamental Rights just because you have nostalgia.",
            "score": 2,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1i0ju",
            "author": "apxseemax",
            "body": "Bruh. The only thing you comment screams is that you do not understand a single thing about what this could cause should it be agreed upon.",
            "score": 1,
            "depth": 1,
            "sentiment": "neutral"
        },
        {
            "id": "ni1goua",
            "author": "Matyaslike",
            "body": "We do the greatest service for humanity by always pointing out what not to do. You are all welcome.",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1k8u3",
            "author": "Vannnnah",
            "body": "you underestimate how many people are secretly or sometimes not so secretly agreeing with Orban on some things but are staying silent to not fall from grace in public",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1i07n",
            "author": "HeyGayHay",
            "body": "You think right, most don’t know about it. Those who do heard a short news report about „regulation for social media and chats to protect the kids in the internet“ which sounds good to them because they associate social media with bad habits and online predators are everywhere to steal their kids through chats in roblox. They don’t understand that random people will be able to see your private life, people can spy on businesses and their secrets and sell it, the hacker bears will 100% infiltrate it and find ways to social engineer the population close to voting cycles, presumably even the US will abuse it, and politicians can protect their pedophile siblings from chat control.\n\nOutside of reddit, this is rarely mentioned. As always, reddit is a small minority and even if you share this screenshot to most people they only see 33% opposition and think it’s never gonna pass so why spend the effort when you have other issues like rambling on facebook about something ",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1fvmb",
            "author": "AnalTinnitus",
            "body": "This.  The news keeps us distracted with immigrants and celebrity rubbish.",
            "score": 4,
            "depth": 2,
            "sentiment": "disgust"
        },
        {
            "id": "ni1adct",
            "author": "Cool-Psychology-4896",
            "body": "We need to rise up against children with leukemia.",
            "score": 20,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1ax7d",
            "author": "Florestana",
            "body": "Thank you for being sane",
            "score": -3,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni19tgx",
            "author": "TheSmokeu",
            "body": "Proximity bias\n\nOutside of Reddit, chat control law proposition is pretty much unheard of",
            "score": 18,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni19wk1",
            "author": "Zestyclose-Cow8549",
            "body": "He obviously means in the EU on the street/traditional media",
            "score": 6,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1asev",
            "author": "Hopeful_Hat_3532",
            "body": "Reddit is not the only \"media\", and certainly not \"politicians\".  \nWhat about news websites, newspapers, tv news, social networks, etc. ?",
            "score": 2,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1a558",
            "author": "slimfatty69",
            "body": "I think \"about it here\" was probs refrencing a local news outlet.",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1j4kr",
            "author": "gccol",
            "body": "Exactly, I don't get it neither",
            "score": 1,
            "depth": 2,
            "sentiment": "surprise"
        },
        {
            "id": "ni1ja1h",
            "author": "silentspectator27",
            "body": "European Council: This body comprises the heads of state or government of the EU (the people from France that are in Favour).\nThe chart shows the members of the European Parliament",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1c0vc",
            "author": "Striking_Chef739",
            "body": "🤣 I'll support Trump in his one hahah",
            "score": 2,
            "depth": 2,
            "sentiment": "joy"
        },
        {
            "id": "ni1cds2",
            "author": "juicythumbs",
            "body": "I personally don't want to hive up hope.",
            "score": 3,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni1g3sl",
            "author": "aurelag",
            "body": "Then if the council is for the bill, can the parliament block it ? Because the parliament is more encouraging",
            "score": 1,
            "depth": 2,
            "sentiment": "neutral"
        },
        {
            "id": "ni19st5",
            "author": "John_Hater",
            "body": "LOL. As if that matters at all. Politicians do whatever they want, especially when they get marching orders from Central. Just like Starmer in UK does whatever the fuck he wants despite the huge public backlash.\n\nBut it's okay, it's okay, next elections AUR will have 50% all by itself. All this bullshit eventually has consequences, you can only piss off the people for as long as they have no alternatives.",
            "score": -2,
            "depth": 2,
            "sentiment": "anger"
        },
        {
            "id": "ni1akmc",
            "author": "TheSmokeu",
            "body": "Those freaking children with leukemia",
            "score": 4,
            "depth": 3,
            "sentiment": "anger"
        },
        {
            "id": "ni1ccfw",
            "author": "SaltyHater",
            "body": "I've been very vocal about how we should all oppose the damn leukemiatards, but nobody imprisoned me yet. \n\nGuys, I'm starting to believe that kids with leukemia aren't actually the problem",
            "score": 3,
            "depth": 3,
            "sentiment": "anger"
        },
        {
            "id": "ni1f8z5",
            "author": "Iranon79",
            "body": "We should be able to criticize children with leukemia, and for the most part we are.\n\nThey have it rough, and we're rightfully expected to show some humanity. But if one is being an asshat we can point it out, doubly so if they're exploiting the baseline sympathy they get.",
            "score": 2,
            "depth": 3,
            "sentiment": "neutral"
        },
        {
            "id": "ni1apr6",
            "author": "Florestana",
            "body": "\"Nobody talks about it here\"\n\nI interpreted that as reddit/r/Europe\n\nI see now that the commenter probably meant their country. Wasn't exactly clear tho",
            "score": 0,
            "depth": 3,
            "sentiment": "neutral"
        },
        {
            "id": "ni1cpdv",
            "author": "SeaTomago",
            "body": "Denmark did not propose this. It is another misconception of the author. The European Commission has for most intents and purposes the sole power of initiative in the EU and proposed this law. Denmark currently holds the so called presidency of the council of the EU. This presidency changes semi annually. The country having the presidency is expected to coordinate the work of countries in the council of the EU, one of the legislative bodies, in that time. The legislative process has a phase during which both legislators, the Parliament and the Council, agree on their respective internal positions. Denmark had the job to do this for this proposal. This culminated in a so called general approach, i.e. an agreement in the Council for their position in the negotiations with the Parliament on the final legal text. This was done by Denmark, as it is their job to do so for all proposals due for negotiations this half year.",
            "score": 5,
            "depth": 3,
            "sentiment": "neutral"
        },
        {
            "id": "ni1g7xk",
            "author": "silentspectator27",
            "body": "By voting. Problem is that Parliament has voted against for very few Council proposals (like ACTA), and tend to negotiate, rather than outright block.",
            "score": 2,
            "depth": 3,
            "sentiment": "neutral"
        },
        {
            "id": "ni1alfs",
            "author": "DVDPROYTP",
            "body": "It literally does matter becauae most of these MEPs likely don't know or don't care enough about this law. The few MEPs that voiced their opposition did so precisely because voters such as you and me repeatedly contacted them to address their concerns. Because, you know, if voters care about a certain policy it sure is useful to comply since it helps you win elections.\n\nThis is why for example Starmer is not in fact able to just get away with his measures. Because they are dooming labour to another 15 years in the opposition. If that's what they want sure , but they will be punished at the next elections.\n\nAlso can we stop with this stupid \"marching order\" narrative ? There is no such thing as \"marching orders from central\" in Europe (or most places but romanians assume the planet functions like the fucking PCR). This is not hoi4, this is real life.",
            "score": 3,
            "depth": 3,
            "sentiment": "neutral"
        },
        {
            "id": "ni1fk9v",
            "author": "uxreqo",
            "body": "nah you just gotta double down on em",
            "score": 3,
            "depth": 4,
            "sentiment": "neutral"
        },
        {
            "id": "ni1f67y",
            "author": "silentspectator27",
            "body": "And one of the authors of said proposal that continues to say people don’t deserve internet privacy happens to be Denmark’s MoJ.",
            "score": 5,
            "depth": 4,
            "sentiment": "neutral"
        },
        {
            "id": "ni1g9ql",
            "author": "aurelag",
            "body": "Ok thanks !",
            "score": 1,
            "depth": 4,
            "sentiment": "joy"
        },
        {
            "id": "ni1l8wc",
            "author": "Ok-Captain-5207",
            "body": "Just look at his posts/comments. He is an uneducated gamer and also a grifter. Too bad Chat Control won't affect only these type of people.",
            "score": 1,
            "depth": 4,
            "sentiment": "disgust"
        },
        {
            "id": "ni1fpfe",
            "author": "SeaTomago",
            "body": "To reach a general approach a vote in COREPER takes place which is usually based on collegiality and unanimity as much as possible. MoJ or equivalent (to be correct permanent representatives as ministers are not in COREPER, ministers did not necessarily vote at all depending on if it was an A or B item) from all MS agreed with the general approach. Singling out Denmark makes no sense and is harmful.",
            "score": 1,
            "depth": 5,
            "sentiment": "disgust"
        },
        {
            "id": "ni1g40q",
            "author": "silentspectator27",
            "body": "Hogwash. The Danish government has been supporting image and chat scanning. In fact the Danish MoJ was caught spreading false narratives that Parliament was pushing for a permanent decision on the interim law in place.",
            "score": 1,
            "depth": 6,
            "sentiment": "disgust"
        }
    ]
}